Revit 2027 API
ExternalResourceBrowserData.CallingDocumentHasModelPath Method
 Indicates whether the document requesting the external resource browser data has a defined ModelPath.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CallingDocumentHasModelPath()
Public Function CallingDocumentHasModelPath As Boolean
public:
bool CallingDocumentHasModelPath()
member CallingDocumentHasModelPath : unit -> bool
Return Value
Boolean
 True if the document has a defined ModelPath.
Remarks
 A project that is detached, or has not been saved to disk yet, will not have a ModelPath.
See Also
Reference
ExternalResourceBrowserData Class
Autodesk.Revit.DB Namespace